system/substrate/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2312                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       dictionary;
    location    "system/substrate";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

PIMPLE
{
    momentumPredictor yes;
    nOuterCorrectors 2;
    nCorrectors 1;
    nNonOrthogonalCorrectors 0;
}

solvers
{
    h
    {
        solver      PCG;
        preconditioner DIC;
        tolerance   1e-8;
        relTol      0.1;
    }

    hFinal
    {
        solver      PCG;
        preconditioner DIC;
        tolerance   1e-8;
        relTol      0.01;
    }
}

PIMPLE
{
    nOuterCorrectors 1;
}



// ************************************************************************* //
